"use strict"

// Переберите циклом числа от 0 до 1000 и выведите в консоль первую цифру каждого числа.

// for (let i = 0; i <= 1000; i++) {
//     let str = String(i);
//     console.log(Number(str[0]));
// }



// Переберите циклом числа от 10 до 100 и выведите в консоль сумму первой и второй цифры каждого числа.

// for (let i = 10; i <= 100; i++) {
//     let str = String(i);
//     let sum = Number(str[0]) + Number(str[1]);
//     console.log(sum);
// }



// Переберите циклом числа от 0 до 100 и выведите те числа, первая цифра которых равна 1.

// for (let i = 0; i <= 100; i++) {
//     let str = String(i);
    
//     if (Number(str[0]) === 1) {
//         console.log(i);
//     }
// }



// Переберите циклом числа от 10 до 1000 и выведите на экран те числа, сумма двух первых цифр которых равна 5.

// for (let i = 10; i <= 1000; i++) {
//     let str = String(i);

//     if (Number(str[0]) + Number(str[1]) === 5) {
//         console.log(i);
//     }
// }